zozo825117/iqs316_mb9bf506/iqs316_prox_test/example/source/app/iqs316/upper level IQS316.c
//---------------------------------------------------------------------------//
//
//! @file 		upper level IQS316.c
//! @brief    IQS316 specific functions for I2C Firmware library
//
//! @author 	zozo 
//! @version 	v0.1
//! @note
//!     
//! 
//! 修改日志  :
//! 2012.12.10    创建初试 zozo
//! 2013.7.31 增加 void CommsIQSxxx_Read_continuous(uint8_t read_addr ,uint8_t *data,uint8_t NoOfBytes) zozo
//! 2013.7.31 增加iqs316_debug调试监控 zozo
//---------------------------------------------------------------------------//
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      revision   :  IQS316 I2C Firmware library rev 1.00
          date   :  2010-08-05
            by   :  Gerhard du Toit  Azoteq (Pty) Ltd 
   description   :  Basic functions to implement IQS316 via I2C (msp430f4619 was used)
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//****************************************************************************
// 头文件
//****************************************************************************/
#include "mb9bf506r.h"
#include "board.h"
#include "IQS316.h"
#include "iqs316_define.h"
#include "lower level mb9bfxxx.h"
#include "upper level IQS316.h"
  
//****************************************************************************
// 变量定义
//****************************************************************************/
IQS316_t IQS316; 

#ifdef IQS316_DEBUG

IQS316_debug_t Iqs316DebugInfo[IQS316_KEY_NUMBER];

/*touch mode*/
static uint8_t time_up=0,prox_release=0;

/*test*/
static int8_t history_delta_buf[100],history_delta_ptr=0;


void iqs316_debug(void)
{
  uint8_t temp,start_num;
 	union
  {
    uint16_t lta_word[4];
    uint8_t lta_byte[8];
  }temp_lta_u;

 	/* */ 
	temp =  CommsIQSxxx_Read(PROX_SETTINGS_2);
  temp |= BIT3|BIT1|BIT0;                   						//SKIP_CONV long term noise disabled still
	CommsIQSxxx_Write(PROX_SETTINGS_2, temp);       //disable watchdog, //skip conversions, //disable LTN (set bit)
	CommsIQSxxx_stop();	

  
	start_num = CommsIQSxxx_Read(GROUP_NUM);
	temp = start_num;  
	do{

     
      temp_lta_u.lta_byte[1] = CommsIQSxxx_Read(LTA_04_HI)&0x0f;
      temp_lta_u.lta_byte[0] = CommsIQSxxx_Read(LTA_04_LO);
      temp_lta_u.lta_byte[3] = CommsIQSxxx_Read(LTA_15_HI)&0x0f;
      temp_lta_u.lta_byte[2] = CommsIQSxxx_Read(LTA_15_LO);
      temp_lta_u.lta_byte[5] = CommsIQSxxx_Read(LTA_26_HI)&0x0f;
      temp_lta_u.lta_byte[4] = CommsIQSxxx_Read(LTA_26_LO);
      temp_lta_u.lta_byte[7] = CommsIQSxxx_Read(LTA_37_HI)&0x0f;
      temp_lta_u.lta_byte[6] = CommsIQSxxx_Read(LTA_37_LO);
        
		   /*
		CommsIQSxxx_Read_continuous(LTA_04_HI,temp_lta_u.lta_byte,8);*/
		nop();    
		switch (temp)
		{
			case 0:
          Iqs316DebugInfo[0].Lta = temp_lta_u.lta_word[0];
          Iqs316DebugInfo[1].Lta = temp_lta_u.lta_word[1];
					Iqs316DebugInfo[2].Lta = temp_lta_u.lta_word[2];
					Iqs316DebugInfo[3].Lta = temp_lta_u.lta_word[3];
				break;
				
			case 1:
          Iqs316DebugInfo[4].Lta = temp_lta_u.lta_word[0];
          Iqs316DebugInfo[5].Lta = temp_lta_u.lta_word[1];
					Iqs316DebugInfo[6].Lta = temp_lta_u.lta_word[2];
					Iqs316DebugInfo[7].Lta = temp_lta_u.lta_word[3];
				break;
			case 2:	
          Iqs316DebugInfo[8].Lta = temp_lta_u.lta_word[0];
          Iqs316DebugInfo[9].Lta = temp_lta_u.lta_word[1];
					Iqs316DebugInfo[10].Lta = temp_lta_u.lta_word[2];
					Iqs316DebugInfo[11].Lta = temp_lta_u.lta_word[3];


				break;
			case 3:
          Iqs316DebugInfo[12].Lta = temp_lta_u.lta_word[0];
          Iqs316DebugInfo[13].Lta = temp_lta_u.lta_word[1];
					Iqs316DebugInfo[14].Lta = temp_lta_u.lta_word[2];
					Iqs316DebugInfo[15].Lta = temp_lta_u.lta_word[3];


				break;
				
			case 4:
          Iqs316DebugInfo[16].Lta = temp_lta_u.lta_word[0];
          Iqs316DebugInfo[17].Lta = temp_lta_u.lta_word[1];
					Iqs316DebugInfo[18].Lta = temp_lta_u.lta_word[2];
					Iqs316DebugInfo[19].Lta = temp_lta_u.lta_word[3];	
				break;
		}
		CommsIQSxxx_stop();	

		temp = CommsIQSxxx_Read(GROUP_NUM);
	} while (temp != start_num);
  

		CommsIQSxxx_Write(PROX_SETTINGS_2, PROX_SETTINGS_2_DEF);       //默认值 
		CommsIQSxxx_stop();		
}
#endif


//---------------------------------------------------------------------------//
//
//! @brief 			IQS316_ATI
//! @author 		zozo
//! @note       
//! @param 			mode:0 prox ati 1 touch ait
//!             
//! @return  		void
//!
//!	@deprecated none
//! @since 2012.11.28
//! @see   
//---------------------------------------------------------------------------//
void IQS316_ATI(uint8_t mode)
{
	uint8_t temp;

	temp =  CommsIQSxxx_Read(PROX_SETTINGS_2);
	temp &=~ (BIT5|BIT4|BIT3);
  temp |= BIT1|BIT0;                   						//long term noise disabled still
	CommsIQSxxx_Write(PROX_SETTINGS_2, temp);       //disable watchdog, //skip conversions, //disable LTN (set bit)
	CommsIQSxxx_stop();	
	
	if(mode==1)
	{
    /***********TOUCH ATI**************/

		CommsIQSxxx_Write(AUTO_ATI_TARGET_HI, TOUCH_ATI_TARGET_HI);
		CommsIQSxxx_Write(AUTO_ATI_TARGET_LO, TOUCH_ATI_TARGET_LO);
		CommsIQSxxx_stop();
		
		temp = CommsIQSxxx_Read(UI_SETTINGS0);   
		CommsIQSxxx_Write(UI_SETTINGS0, temp | 0x40);
		CommsIQSxxx_stop();

	  
	}
	else if(mode==2)
	{
 
	}
	else
	{
    /***********PROX ATI**************/
		CommsIQSxxx_Write(AUTO_ATI_TARGET_HI, PROX_ATI_TARGET_HI);             //AUTO ATI LEVELS - 2000
		CommsIQSxxx_Write(AUTO_ATI_TARGET_LO, PROX_ATI_TARGET_LO);      
		CommsIQSxxx_stop();
		
		temp = CommsIQSxxx_Read(UI_SETTINGS0);
		CommsIQSxxx_Write(UI_SETTINGS0,temp & 0xBF);        //Prox auto ati - just clear bit 6
		CommsIQSxxx_stop();		

	}

  temp = CommsIQSxxx_Read(PROX_SETTINGS_1);   
  CommsIQSxxx_Write(PROX_SETTINGS_1,temp | 0x08);  //AUTO ATI 
  CommsIQSxxx_stop();
    
  temp = CommsIQSxxx_Read(UI_FLAGS0);   
  CommsIQSxxx_stop();
    
  while((temp & 0x04) != 0){
    temp = CommsIQSxxx_Read(UI_FLAGS0);
    CommsIQSxxx_stop();
  };

	CommsIQSxxx_Write(PROX_SETTINGS_2, PROX_SETTINGS_2_DEF);       //默认值 
	CommsIQSxxx_stop();		
}


