zozo825117/iqs316_mb9bf506/iqs316_prox_test/example/source/app/iqs316/upper level IQS316.c
/*
	Function name:	setChanReseed
	Parameters: 		ch 
	Parameters: 		bit
	Return: 				None
	Description:	
*/
void setChanReseed(uint8_t ch, uint8_t bit)
{
	CommsIQSxxx_Write(ch, bit);
}

/*
	Function name:	setProxMode
	Parameters:		None
	Return:				None
	Description:	
*/
void setProxMode(void)
{
	uint8_t temp;
	temp = CommsIQSxxx_Read(UI_SETTINGS0);
	temp &=~ BIT2;
	temp |= BIT3;
	CommsIQSxxx_Write(UI_SETTINGS0, temp);
	
}
/*
	Function name:	setTouchMode
	Parameters:		None
	Return:				None
	Description:	
*/
void setTouchMode(void)
{
	uint8_t temp;
	temp = CommsIQSxxx_Read(UI_SETTINGS0);
	temp |= BIT2;
	temp &=~ BIT3;
	CommsIQSxxx_Write(UI_SETTINGS0, temp);
	time_up =0;
	
}
/*
Function name:	ScanProxChan
Parameters: 	none
Return: 			rc:1 detected 0 no
Description:	

*/
uint8_t ScanProxChan(void)
{
	uint8_t temp,temp_num;
	uint8_t i=0,j=0;

#ifdef IQS316_DEBUG
				uint8_t buf[20];
				union
				{
					uint16_t lta_word[4];
					uint8_t lta_byte[8];
				}temp_lta_u;
	
				union
				{
					uint16_t cs_word[4];
					uint8_t cs_byte[8];
				}temp_cs_u;
	
				int16_t temp_delta[4];
#endif
        
    CommsIQSxxx_stop();
		/*
			disable stop comm
		*/
		temp = CommsIQSxxx_Read(PROX_SETTINGS_2);
		temp &=~ BIT5;
		CommsIQSxxx_Write(PROX_SETTINGS_2, temp); 
		/*
			look at mode indicator bit
		*/

	
		temp_num = CommsIQSxxx_Read(GROUP_NUM);
		if(0==temp_num)
			{
	#ifdef IQS316_DEBUG
					CommsIQSxxx_Read_continuous(LTA_04_HI,&buf[0],8);  //lta
					CommsIQSxxx_Read_continuous(CUR_SAM_04_HI,&buf[8],8);  //current sample
					
					for(i=0,j=0;i<4;i++)
					{
						
						temp_lta_u.lta_byte[j] = buf[j+1];
						temp_lta_u.lta_byte[j+1] = buf[j];
						temp_lta_u.lta_word[i] &= 0x0fff;
						
						temp_cs_u.cs_byte[j] = buf[j+1+8];
						temp_cs_u.cs_byte[j+1] = buf[j+8];
						j+=2;
		
						temp_delta[i] = temp_lta_u.lta_word[i] - temp_cs_u.cs_word[i];
					}
					
					Iqs316DebugInfo[0].Lta = temp_lta_u.lta_word[0];
					Iqs316DebugInfo[1].Lta = temp_lta_u.lta_word[1];
					Iqs316DebugInfo[2].Lta = temp_lta_u.lta_word[2];
					Iqs316DebugInfo[3].Lta = temp_lta_u.lta_word[3];
					Iqs316DebugInfo[0].CurtSample = temp_cs_u.cs_word[0];
					Iqs316DebugInfo[1].CurtSample = temp_cs_u.cs_word[1];
					Iqs316DebugInfo[2].CurtSample = temp_cs_u.cs_word[2];
					Iqs316DebugInfo[3].CurtSample = temp_cs_u.cs_word[3];
					Iqs316DebugInfo[0].Delta= temp_delta[0];
					Iqs316DebugInfo[1].Delta = temp_delta[1];
					Iqs316DebugInfo[2].Delta = temp_delta[2];
					Iqs316DebugInfo[3].Delta = temp_delta[3]; 

					
#endif
			}
return 0;
}

/*
	Function name:	setTouchMode
	Parameters:		uint8_t prox_state
	Return:				rc:1 detected 0 no
	Description:	
*/
uint8_t ProxDetect(uint8_t prox_state)
{
	uint8_t rc = 0,i,continus,cnt=10;
	int16_t delta=0; 
  static int32_t capfilter=0;  

	do{
	/*sum use group0 delta*/ 
		for(i=0;i<4;i++)
			{
				if(PM_CX_SELECT_DEF & (1<<i))
					{
						delta += Iqs316DebugInfo[i].Delta;
					}
			}
		
		history_delta_buf[history_delta_ptr++]=delta;
		/*iir filter*/
    capfilter -= ((capfilter - delta) >>3);

		if(history_delta_ptr>=100)
			{
				history_delta_ptr=0;
			}
		
    delta=0;

		if(capfilter >= PM_CHK_MAX_THRESHOLD )	//|| delta > PM_CHK_MAX_THRESHOLD
			{
				rc = 1;
				break;
			}

		if(prox_state)
			{
				continus = 1;
				ScanProxChan();
			}
		else
			{
				break;
			}

			


	}while(continus && cnt--);

	


		return rc;
}
/*
	Function name:	IQS316_Settings
	Parameters:		None
	Return:			None
	Description:	Sends commands to set thresholds of the IQS316 via the comms terminal.
					This is done, by disabling the conversion mode of the IQS316 (by setting
					the SKIP_CONV bit, PROX_SETTINGS_2[3])
					Each group is now accessed by initialising new conversions and in each
					group the respective thresholds are written as desired.
					Remember to set the Prox Range and Touch Range bits (UI_SETTINGS[5,4])
					to access either high range or low range thresholds.
*/
void IQS316_Settings(void)
{
	uint8_t start_num, temp;
	int i = 0;
	uint8_t temp_lta;
	//uint8_t cs_h, cs_l, group_num, ui_settings, auto_ati_h, auto_ati_l,pcc;
	
	CommsIQSxxx_Init_Conversion();

  /*
  		setting register start  will use about 2~3 second
  		*/ 
#ifdef IQS316_DEBUG
  temp =  CommsIQSxxx_Read(PROD_NUM);
  if(temp!=27)
  {
    nop(); //通讯异常
  }
#endif  


  CommsIQSxxx_Write(UI_SETTINGS0,UI_SETTINGS0_DEF); 
  //add zozo
	//setProxMode();
	//-------
  CommsIQSxxx_Write(PROX_SETTINGS_1,PROX_SETTINGS_1_DEF);  
  CommsIQSxxx_Write(PROX_SETTINGS_2,PROX_SETTINGS_2_DEF);  

	
  
	//set prox mode
	CommsIQSxxx_Write(PM_CX_SELECT, PM_CX_SELECT_DEF);			//all channel groups for prox mode
	CommsIQSxxx_Write(CHAN_ACTIVE0, CHAN_ACTIVE0_DEF);			
	/*
	 set touch channal
	*/
	CommsIQSxxx_Write(CHAN_ACTIVE1, CHAN_ACTIVE1_DEF);			    
	CommsIQSxxx_Write(CHAN_ACTIVE2, CHAN_ACTIVE2_DEF);			    
	CommsIQSxxx_Write(CHAN_ACTIVE3, CHAN_ACTIVE3_DEF);			    
	CommsIQSxxx_Write(CHAN_ACTIVE4, CHAN_ACTIVE4_DEF);			    
	CommsIQSxxx_stop();


 	/*
 		 initial channl   Threshold & ATI Multiplier C
	*/ 
	temp =  CommsIQSxxx_Read(PROX_SETTINGS_2);
	temp |= BIT3|BIT1|BIT0;                   					//Skip Conv  long term noise disabled still
	CommsIQSxxx_Write(PROX_SETTINGS_2, temp);           //disable watchdog, //skip conversions, //disable LTN (set bit)
	CommsIQSxxx_stop();
	            
	start_num = CommsIQSxxx_Read(GROUP_NUM);
	temp = start_num;

	do{
		switch (temp)
		{
			case 0:
					temp_lta = CommsIQSxxx_Read(LTA_04_HI);
					CommsIQSxxx_Write(LTA_04_HI, temp_lta | PROX_THRESHOLD_CH0);
					temp_lta = CommsIQSxxx_Read(LTA_15_HI);
					CommsIQSxxx_Write(LTA_15_HI, temp_lta | PROX_THRESHOLD_CH1);
					temp_lta = CommsIQSxxx_Read(LTA_26_HI);
					CommsIQSxxx_Write(LTA_26_HI, temp_lta | PROX_THRESHOLD_CH2);
					temp_lta = CommsIQSxxx_Read(LTA_37_HI);
					CommsIQSxxx_Write(LTA_37_HI, temp_lta | PROX_THRESHOLD_CH3);
					CommsIQSxxx_Write(ATI_MULT1, ATI_MULT1_GRP0);  
				break;
				
			case 1:
					temp_lta = CommsIQSxxx_Read(LTA_04_HI);
					CommsIQSxxx_Write(LTA_04_HI, temp_lta | TOUCH_THRESHOLD_CH4);
					temp_lta = CommsIQSxxx_Read(LTA_15_HI);
					CommsIQSxxx_Write(LTA_15_HI, temp_lta | TOUCH_THRESHOLD_CH5);
					temp_lta = CommsIQSxxx_Read(LTA_26_HI);
					CommsIQSxxx_Write(LTA_26_HI, temp_lta | TOUCH_THRESHOLD_CH6);
					temp_lta = CommsIQSxxx_Read(LTA_37_HI);
					CommsIQSxxx_Write(LTA_37_HI, temp_lta | TOUCH_THRESHOLD_CH7);
					CommsIQSxxx_Write(ATI_MULT1, ATI_MULT1_GRP1);  
				break;
			case 2:		
					temp_lta = CommsIQSxxx_Read(LTA_04_HI);
					CommsIQSxxx_Write(LTA_04_HI, temp_lta | TOUCH_THRESHOLD_CH8);
					temp_lta = CommsIQSxxx_Read(LTA_15_HI);
					CommsIQSxxx_Write(LTA_15_HI, temp_lta | TOUCH_THRESHOLD_CH9);
					temp_lta = CommsIQSxxx_Read(LTA_26_HI);
					CommsIQSxxx_Write(LTA_26_HI, temp_lta | TOUCH_THRESHOLD_CH10);
					temp_lta = CommsIQSxxx_Read(LTA_37_HI);
					CommsIQSxxx_Write(LTA_37_HI, temp_lta | TOUCH_THRESHOLD_CH11);
					CommsIQSxxx_Write(ATI_MULT1, ATI_MULT1_GRP2);  
				break;
			case 3:
					temp_lta = CommsIQSxxx_Read(LTA_04_HI);
					CommsIQSxxx_Write(LTA_04_HI, temp_lta | TOUCH_THRESHOLD_CH12);
					temp_lta = CommsIQSxxx_Read(LTA_15_HI);
					CommsIQSxxx_Write(LTA_15_HI, temp_lta | TOUCH_THRESHOLD_CH13);
					temp_lta = CommsIQSxxx_Read(LTA_26_HI);
					CommsIQSxxx_Write(LTA_26_HI, temp_lta | TOUCH_THRESHOLD_CH14);
					temp_lta = CommsIQSxxx_Read(LTA_37_HI);
					CommsIQSxxx_Write(LTA_37_HI, temp_lta | TOUCH_THRESHOLD_CH15);
					CommsIQSxxx_Write(ATI_MULT1, ATI_MULT1_GRP3);  
				break;
				
			case 4:
					temp_lta = CommsIQSxxx_Read(LTA_04_HI);
					CommsIQSxxx_Write(LTA_04_HI, temp_lta | TOUCH_THRESHOLD_CH16);
					temp_lta = CommsIQSxxx_Read(LTA_15_HI);
					CommsIQSxxx_Write(LTA_15_HI, temp_lta | TOUCH_THRESHOLD_CH17);
					temp_lta = CommsIQSxxx_Read(LTA_26_HI);
					CommsIQSxxx_Write(LTA_26_HI, temp_lta | TOUCH_THRESHOLD_CH18);
					temp_lta = CommsIQSxxx_Read(LTA_37_HI);
					CommsIQSxxx_Write(LTA_37_HI, temp_lta | TOUCH_THRESHOLD_CH19);				
					CommsIQSxxx_Write(ATI_MULT1, ATI_MULT1_GRP4);    			
				break;
		}
		CommsIQSxxx_stop();	
 		
    for (i = 0; i < 10; i++)           //time to settle
        delay_ms(1); 

		temp = CommsIQSxxx_Read(GROUP_NUM);
	} while (temp != start_num);
	
	CommsIQSxxx_stop();	
	
	/*ATI*/ 
  IQS316_ATI(1);
  IQS316_ATI(0);

#ifdef IQS316_DEBUG
  iqs316_debug();
#endif

	setProxMode();
	CommsIQSxxx_Write(PROX_SETTINGS_2, PROX_SETTINGS_2_DEF | BIT5);       //stop comm 
	CommsIQSxxx_stop();			

			
