zozo825117/iqs316_mb9bf506/iqs316_prox_test/example/source/app/iqs316/upper level IQS316.c
}


/*
	Function name:	init
	Parameters:		none
	Return:			none
	Description: 	Responsible for initializing the PIC16LF1827 ports and calling other 
					initialization functions.
*/
void Init_iqs316(void)
{

/*
	Needed if port initialization is done here
*/		
	//ready line input
	Comms_init();	
/*
	Place other functions responsible for hardware initialization here.
*/	
	IQS316_Settings();
}

/*
	Function name:	IQS316_New_Conversion
	Parameters:		None
	Return:			None
	Description:	Sends command to IQS316 to initiate a new conversion (0xFE). The group number is read to determine
					whether the IQS316 is in PROX mode or TOUCH mode. If the group number is 0, PROX mode, the prox_detected
					flag is cleared and the routine finishes.
					If the group number is not 0, then conversions are called to access each of the four groups. The PROX and
					TOUCH status registers for each group is read and stored in the global data structure. The prox_detected
					flag is set and the routine finishes.
	Global implication:		After calling this function, the data of the IQS316 can be accessed in the struct IQS316,
							which has the following members.
							prox_detected (flag to indicate prox mode or touch mode)
							prox4_11 (prox status for channels 4-11)
							prox12_19 (prox status for channels 12-19)
							touch4_11 (touch status for channels 4-11)
							touch12_19 (touch status for channels 12-19)
*/
void IQS316_New_Conversion(void)
{
  uint8_t temp,temp_num, temp_flag,start_num=0, temp_touch, temp_prox;
	uint8_t i=0,j=0,touch_detected=0,prox_detected=0;
	
  #ifdef IQS316_DEBUG
			  uint8_t ptr,buf[20];
			 	union
			  {
			    uint16_t lta_word[4];
			    uint8_t lta_byte[8];
			  }temp_lta_u;

			 	union
			  {
			    uint16_t cs_word[4];
			    uint8_t cs_byte[8];
			  }temp_cs_u;

				int16_t temp_delta[4];
	#endif
  
		/*
			disable stop comm
		*/
		temp = CommsIQSxxx_Read(PROX_SETTINGS_2);
		temp &=~ BIT5;
		CommsIQSxxx_Write(PROX_SETTINGS_2, temp); 
		/*
			look at mode indicator bit
		*/
		temp_flag = CommsIQSxxx_Read(UI_FLAGS0); 

		temp_num = CommsIQSxxx_Read(GROUP_NUM);

		do
		{

			temp_touch = CommsIQSxxx_Read(TOUCH_STAT);
			temp_prox = CommsIQSxxx_Read(PROX_STAT);
			
#ifdef IQS316_DEBUG
			CommsIQSxxx_Read_continuous(LTA_04_HI,&buf[0],8);  //lta
			CommsIQSxxx_Read_continuous(CUR_SAM_04_HI,&buf[8],8);  //current sample
			
			for(i=0,j=0;i<4;i++)
			{
			  
				temp_lta_u.lta_byte[j] = buf[j+1];
				temp_lta_u.lta_byte[j+1] = buf[j];
				temp_lta_u.lta_word[i] &= 0x0fff;
				
				temp_cs_u.cs_byte[j] = buf[j+1+8];
				temp_cs_u.cs_byte[j+1] = buf[j+8];
				j+=2;

				temp_delta[i] = temp_lta_u.lta_word[i] - temp_cs_u.cs_word[i];
			}
#endif

      if(temp_touch)
      {
      	touch_detected = 1;
      }
      if(temp_prox)
      {
      	prox_detected = 1;
      }
	       // x++;
			switch(temp_num)
			{
				case 0:
					ptr = 0;
					goto skip_stop;
					break;
					
				case 1:
					IQS316.prox4_11 = IQS316.prox4_11 & 0xF0;
					IQS316.touch4_11 = IQS316.touch4_11 & 0xF0;
					IQS316.prox4_11 = IQS316.prox4_11 | (temp_prox & 0x0F);
					IQS316.touch4_11 = IQS316.touch4_11 | (temp_touch & 0x0F);
					ptr = 4;
					break;
				case 2:
					IQS316.prox4_11 = IQS316.prox4_11 & 0x0F;
					IQS316.touch4_11 = IQS316.touch4_11 & 0x0F;
					IQS316.prox4_11 = IQS316.prox4_11 | ((temp_prox & 0x0F) << 4);
					IQS316.touch4_11 = IQS316.touch4_11 | ((temp_touch & 0x0F) << 4);
					ptr = 8;
					break;
				case 3:
					IQS316.prox12_19 = IQS316.prox12_19 & 0xF0;
					IQS316.touch12_19 = IQS316.touch12_19 & 0xF0;
					IQS316.prox12_19 = IQS316.prox12_19 | (temp_prox & 0x0F);
					IQS316.touch12_19 = IQS316.touch12_19 | (temp_touch & 0x0F);
					ptr = 12;
					break;
				case 4:
					IQS316.prox12_19 = IQS316.prox12_19 & 0x0F;
					IQS316.touch12_19 = IQS316.touch12_19 & 0x0F;
					IQS316.prox12_19 = IQS316.prox12_19 | ((temp_prox & 0x0F) << 4);
					IQS316.touch12_19 = IQS316.touch12_19 | ((temp_touch & 0x0F) << 4);
					ptr = 16;
					break;
			    default:    
		             
			    break;
			}
		
			CommsIQSxxx_stop();
skip_stop:			
#ifdef IQS316_DEBUG
	    Iqs316DebugInfo[0+ptr].Lta = temp_lta_u.lta_word[0];
	    Iqs316DebugInfo[1+ptr].Lta = temp_lta_u.lta_word[1];
			Iqs316DebugInfo[2+ptr].Lta = temp_lta_u.lta_word[2];
			Iqs316DebugInfo[3+ptr].Lta = temp_lta_u.lta_word[3];
	    Iqs316DebugInfo[0+ptr].CurtSample = temp_cs_u.cs_word[0];
	    Iqs316DebugInfo[1+ptr].CurtSample = temp_cs_u.cs_word[1];
			Iqs316DebugInfo[2+ptr].CurtSample = temp_cs_u.cs_word[2];
			Iqs316DebugInfo[3+ptr].CurtSample = temp_cs_u.cs_word[3];
	    Iqs316DebugInfo[0+ptr].Delta= temp_delta[0];
	    Iqs316DebugInfo[1+ptr].Delta = temp_delta[1];
			Iqs316DebugInfo[2+ptr].Delta = temp_delta[2];
			Iqs316DebugInfo[3+ptr].Delta = temp_delta[3];	
#endif
			
			/*
				proximity mode scan once break
			*/
			if((temp_num ==0) && !(temp_flag&0x40))
				{
				 	break;
				}
			/*
				touch mode scan start
			*/
			else if((0!=temp_num) && (temp_flag&0x40) && (0==start_num))
				{
					start_num = temp_num;

				}
			/*
				next group
			*/
			temp_num = CommsIQSxxx_Read(GROUP_NUM);		

		} while ((temp_num != 0) && (temp_num != start_num));

		

		/*
		 proximity detect
		*/   
		if((temp_num ==0) && !(temp_flag&0x40))
			{
			  if(0==prox_release)
			  	{
						if(ProxDetect(prox_detected))
							{
								IQS316.prox_detected = 1;
								setTouchMode();
							}
						else
							{
								IQS316.prox_detected = 0;
							}

			  	}
				else
					{
						prox_release--;
						setChanReseed(CHAN_RESEED0,BIT1|BIT0);
					}

					
			}
		else if((0!=temp_num) && (temp_flag&0x40))
			{
				/*
				 touch detect
				*/
				if(touch_detected)
					{
						IQS316.touch_detected = 1;
						time_up =0;
					}
				else
					{
						IQS316.touch_detected = 0;
						time_up++;
						if( time_up > TOUCH_CHK_CNT)
							{
								setProxMode();
                setChanReseed(CHAN_RESEED0,BIT1|BIT0);
								IQS316.prox_detected = 0;
								prox_release = 1;
							}
					}
			}

		CommsIQSxxx_Write(PROX_SETTINGS_2, PROX_SETTINGS_2_DEF | BIT5);       //stop comm 		
		CommsIQSxxx_stop();
		delay_ms(1);
}




