zozo825117/iqs316_mb9bf506/iqs316_prox_test/example/source/app/iqs316/upper level IQS316.c
/*
	Function name:	IQS316_Process_Conversions
	Parameters:		None
	Return:			None
	Description:	Function to be called after calling for a new conversion, if the prox_detected flag is set.
					This function processes the data contained in the IQS316 struct.
*/
void IQS316_Process_Conversion (void)
{
/*
	Place code here to process data available in the IQS316 structure.
*/

}




/*
	Function name:	CommsIQSxxx_Write
	Parameters:		uint8_t write_addr - the address to be written to
					uint8_t data - the data to be written to the specified address.
	Return:			None
	Description:	Sends the first parameter to the the IQS440, followed by the second.
					The second byte is therefore written in the address of the first given that the IQS440 was
					already in write mode before calling the function.
*/
void CommsIQSxxx_Write(uint8_t write_addr, uint8_t data)
{
	CommsIQSxxx_start();
	CommsIQSxxx_send((IQS316_ADDR << 1) + 0x00);	//initiate I2C Comms in write mode
	CommsIQSxxx_send(write_addr);					//write address
	CommsIQSxxx_send(data);							//write data
}
/*
	Function name:	CommsIQSxxx_Read
	Parameters:		uint8_t read_addr - the address to be read
	Return:			uint8_t - the data that was read from the address on the IQS440
	Description:	Rerturns data read from the IQS440, at a specific address.
					There has to be an active communication window to the IQS440 prior to calling this function.
					I.e. either a start or a repeated start must be called before calling this function.
					This function is specifically for reading one data byte from a specific value. After calling
					this function, either a stop or a repeated start has to be called.
					- Please use CommsIQS440_Cont_Read for reading multiple bytes from the IQS440
*/
uint8_t CommsIQSxxx_Read(uint8_t read_addr)
{
	uint8_t temp;
	
	CommsIQSxxx_start();
	CommsIQSxxx_send((IQS316_ADDR << 1) + 0x00);	//initiates I2C Comms in write mode
	CommsIQSxxx_send(read_addr);					//write address to be read from
	CommsIQSxxx_repeat_start();
	CommsIQSxxx_send((IQS316_ADDR << 1) + 0x01);	//initiates I2C Comms in read mode
	temp = CommsIQSxxx_read_nack();					//NACK indicates that no more reads will follow after this one.
	return temp;
}
/*
	Function name:	CommsIQSxxx_Read_continuous
	Parameters:			uint8_t read_addr ,uint8_t *data,uint8_t NoOfBytes
	Return:					uint8_t - the data that was read from the address on the IQS440
	Description:	

*/
void CommsIQSxxx_Read_continuous(uint8_t read_addr ,uint8_t *data,uint8_t NoOfBytes)
{
	uint8_t i;
	
	CommsIQSxxx_start();
	CommsIQSxxx_send((IQS316_ADDR << 1) + 0x00);	//initiates I2C Comms in write mode
	CommsIQSxxx_send(read_addr);					//write address to be read from
	CommsIQSxxx_repeat_start();
	CommsIQSxxx_send((IQS316_ADDR << 1) + 0x01);	//initiates I2C Comms in read mode
	if (NoOfBytes > 1)
	{
		for (i = 0; i < NoOfBytes - 1; i++)
			data[i] = CommsIQSxxx_read_ack();				// all bytes except last must be followed by an ACK
	}
	
	data[NoOfBytes-1] = CommsIQSxxx_read_nack();			// last byte read must be followed by a NACK
}



/*
	Function name:	CommsIQSxxx_Cont_Read
	Parameters:		uint8_t start_addr - the address where the first byte will be read from
	Return:			uint8_t - the data that was read from the address on the IQS316
	Description:	This function is similiar to the previous one (CommsIQSxxx_Read) and only differs in sending an
					ACK to the IQS316, indicating that another read command will follow this. The data pointer of the
					IQS316 will be incremented for the next read.
*/
uint8_t CommsIQSxxx_Cont_Read(uint8_t start_addr)
{
	uint8_t temp;
	CommsIQSxxx_start();
	CommsIQSxxx_send((IQS316_ADDR << 1) + 0x00);
	CommsIQSxxx_send(start_addr);
	CommsIQSxxx_repeat_start();
	CommsIQSxxx_send((IQS316_ADDR << 1) + 0x01);
	temp = CommsIQSxxx_read_ack();
	return temp;
}




/*
	Function name:	CommsIQSxxx_Read_Next_Cont
	Parameters:		none
	Return:			uint8_t - the data that was read from the IQS316
	Description:	This function has to be used in conjunction with the CommsIQSxxx_Cont_Read function for reading multiple
					bytes from the IQS316. This specific function sends another ACK to the IQS316 and another read command must
					be sent after it. The data pointer will be incremented after executing this command.
*/
uint8_t CommsIQSxxx_Read_Next_Cont(void)
{
	uint8_t temp;
	temp = CommsIQSxxx_read_ack();
	return temp;
}




/*
	Function name:	CommsIQSxxx_Read_Next_Stop
	Parameters:		none
	Return:			uint8_t - the data that was read from the IQS316
	Description:	This function has to be used in conjunction with the CommsIQSxxx_Cont_Read function for reading multiple
					bytes from the IQS316. This specific function sends a NACK to the IQS316 to indicate that this is the last read
					command.
					Either a stop command or a repeated start command has to be sent after this.
*/
uint8_t CommsIQSxxx_Read_Next_Stop(void)
{
	uint8_t temp;
	temp = CommsIQSxxx_read_nack();
	return temp;
}




/*
	Function name:	CommsIQSxxx_Initiate_Conversion
	Parameters:		none
	Return:			none
	Description:	This function initiates a communication window with the IQS316 and then closes it again. 
					In I2C mode a new conversion will automatically be started once the stop bit is received.
					This function should therefore be used if more than one conversion is required between
					read and write operations. (Such as the initial conversions before reseeding and calling 
					the IPA routine.)
*/
void CommsIQSxxx_Init_Conversion(void)
{
	CommsIQSxxx_start();
	CommsIQSxxx_send((IQS316_ADDR << 1) + 0x00);
	CommsIQSxxx_stop();
}





/*
	Function name:	Comms_Error
	Parameters:		none
	Return:			none
	Description:	Function called if an unexpected return value is received communicating
					with the IQS316.
*/
void Comms_Error(void)
{
	/*
		Place error routine code here
	*/
	while (1)
	{}
}

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif
